W6D3/artshareAPI/app/controllers/artwork_shares_controller.rb

    def create
        @artwork_shares = ArtworkShare.new(artwork_shares_params)
        if @artwork_shares.save
---
INSERT INTO "artwork_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 3], ["viewer_id", 10], ["created_at", "2022-05-26 22:53:24.364995"], ["updated_at", "2022-05-26 22:53:24.364995"]]

    def destroy
        @artwork_shares = ArtworkShare.find(params[:id])
        ArtworkShare.destroy(params[:id])
---
SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 8]]