W6D3/artshareAPI/app/controllers/artworks_controller.rb

    def index
        if params[:user_id] == nil
            render json: Artwork.all
        else
            user = User.find_by_id(params[:user_id])
---
SELECT "artworks".* FROM "artworks"
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]

    def create
        @artwork = Artwork.new(artwork_params)
        if @artwork.save
---
INSERT INTO "artworks" ("title", "image_url", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Mona Lisa"], ["image_url", "images.com/7"], ["artist_id", 8], ["created_at", "2022-05-26 22:31:41.543789"], ["updated_at", "2022-05-26 22:31:41.543789"]]

    def update
        @artwork = Artwork.find(params[:id])

        if @artwork.update(artwork_params)
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1, "image_url" = $2, "updated_at" = $3 WHERE "artworks"."id" = $4  [["title", "Brona Lisa"], ["image_url", "bromages.com/7"], ["updated_at", "2022-05-26 22:32:30.387296"], ["id", 7]]

    def destroy
        artwork = Artwork.find(params[:id])
        Artwork.destroy(params[:id])
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 7]]