W6D3/artshareAPI/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["username", "Bobby"], ["created_at", "2022-05-26 21:34:23.776033"], ["updated_at", "2022-05-26 21:34:23.776033"]]
---
    def create
      @user = User.new(user_params)
      # replace the `user_attributes_here` with the actual attribute keys
      if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", "Sasuke"], ["updated_at", "2022-05-26 21:50:10.787421"], ["id", 10]]
---
    def update
      @user = User.find(params[:id])
      # debugger
      if @user.update(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 6]]
---
    def destroy
      user = User.find(params[:id])
      User.destroy(params[:id])