W6D3/learning_routes/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email") VALUES ($1, $2) RETURNING "id"  [["name", "bobb"], ["email", "google.com"]]
---
  def create
    @user = User.new(user_params)
    # replace the `user_attributes_here` with the actual attribute keys
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1 WHERE "users"."id" = $2  [["email", "alan@hotmail.com"], ["id", 2]]
---
  def update
    user = User.find(params[:id])
    user.update!(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 7]]
---
  def destroy
    user = User.find(params[:id])
    User.destroy(params[:id])